# +TITLE: Trump Cryptocurrency and Digital Asset Income Analysis
# +AUTHOR: Antigravity AI Coding Assistant
# +DATE: 2026-07-01

* Executive Summary

This report provides a comprehensive, transparent calculation of all cryptocurrency and digital asset-related income disclosed by Donald J. Trump in his OGE Form 278e annual financial report for 2026. 

Based on the official filing, Donald J. Trump's total income from crypto-related products, companies, and projects ranges from a minimum of *$1,435,616,397.00* to a maximum of *$1,435,653,893.00*, with a midpoint estimate of *$1,435,635,145.00*. 

This matches the **$1.4 billion** total crypto-related income reported in the media, which is derived entirely from the OGE Form 278e filing by grouping the various digital asset holdings and license agreements.

** Major Figures & Critical Insights

1. *The Celebration Coins Anomaly ($635.07M)*: The largest single income source listed in the disclosure is the license agreement with *Celebration Coins* (Line 21.6), which is reported as generating *#$635,068,835.00#* in royalties. While recorded in the official document as such, this number is unusually high and may represent a clerical entry typo (possibly representing $635,068.35). We include the figure exactly as reported in the official filing for transparency.
2. *WLF & Stablecoin Holdco Grouping ($799.47M)*: The media reports "almost $800 million" in income from World Liberty Financial. In the disclosure, this represents the sum of the *World Liberty Financial (WLF)* project (*#$594,263,944.00#*) and the *Stablecoin Holdco LLC* project (*#$205,201,828.00#*), which are structured identically.
3. *Business Interest Sales ($262.50M)*: The media reports "more than $250 million" from the sale of ownership stakes. This is the exact sum of the *WLF Holdco LLC Equity Sale* (Line 124.2) of *#$65,625,000.00#* and the *Stablecoin Holdco Class C Units Sale* (Line 114) of *#$196,875,000.00#*.
4. *Token Sales ($526.81M)*: The media reports "more than $520 million" from the sale of WLF tokens. This is the exact sum of the direct *WLF Token Sales* (Line 124.3) of *#$236,250,000.00#* and the token sales proceeds distributed to *WLF cold wallets* (Lines 124.4 to 124.12) of *#$290,560,321.00#*.
5. *Massive Staking Income ($2.33M)*: Staked Ethereum on Coinbase generated *#$1,821,628.00#* for DT Marks Defi LLC and *#$510,808.00#* for CIC Digital LLC, totaling *#$2,332,436.00#* in validator rewards.
6. *Multi-Million Dollar Cold Storage Assets*: Four separate holdings are valued at *Over $50,000,000.00* each (the highest value category on OGE Form 278e), representing a minimum of *$200,000,000.00* in asset valuation. These include Bitcoin holdings under both CIC Digital LLC and WLF, Ethereum holdings under WLF, and 15.75 Billion WLFI Governance Tokens held by DTTM Operations LLC.

---

* Calculation Methodology

The income was calculated by categorizing all entries from the disclosure that contain references to cryptocurrency wallets (USD, USDC, ETH, BTC, LINK, AAVE, ENA, MOVE, ONDO keys), staking agreements, web3 license agreements (Celebration Coins, NFT INT LLC, JBCZ Group LLC), stablecoin businesses, and crypto-related stocks (Coinbase Global, Inc.).

1. *Exact Values*: For entries where a precise dollar amount was provided (such as token sale proceeds or validator rewards), the exact figure was used in all calculations.
2. *Range Values*: For entries where only a range was provided (typical for interest and dividends on OGE Form 278e), the minimum and maximum boundaries of the range were calculated separately. A midpoint was also calculated to represent a balanced estimate.
3. *WLF Wallets*: Proceeds from token sales held in cold wallets are classified as income distributions under "Proceeds from Token sales distributed by World Liberty Financial LLC" and are summed as part of the overall income.

---

* Detailed Crypto-Related Income Table

Below is the complete list of Trump's crypto-related income, formatted in an Org-mode table:

| Line # | Entity / Holding | Asset / Contract Description | Income Type | Min Income ($) | Max Income ($) | Midpoint ($) |
|--------+------------------+------------------------------+-------------+----------------+----------------+--------------|
| 21.1   | CIC Digital LLC  | U.S. Bank Account            | Interest    |       25001.00 |       50000.00 |     37500.50 |
| 21.3   | CIC Digital LLC  | USDC Cold Wallet             | Interest    |       45932.00 |       45932.00 |     45932.00 |
| 21.4a  | CIC Digital LLC  | Staked Ethereum (Coinbase)   | Validator   |      510808.00 |      510808.00 |    510808.00 |
| 21.6   | CIC Digital LLC  | Celebration Coins License    | Royalties   | 635068835.00 | 635068835.00 | 635068835.00 |
| 21.7   | CIC Digital LLC  | JBCZ Group LLC Sublicense    | Royalties   |      493846.00 |      493846.00 |    493846.00 |
| 21.8   | CIC Digital LLC  | NFT INT, LLC License (Cards) | Royalties   |           0.00 |         200.00 |       100.00 |
| 114    | DT Marks SC LLC  | Stablecoin Holdco Class C   | Equity Sale |  196875000.00 |  196875000.00 | 196875000.00 |
| 124.2  | DT Marks Defi    | WLF Holdco LLC Equity Sale   | Equity Sale |   65625000.00 |   65625000.00 |  65625000.00 |
| 124.3  | DT Marks Defi    | WLF Token Sales              | Token Dist. |  236250000.00 |  236250000.00 | 236250000.00 |
| 124.4  | DT Marks Defi    | WLF USD Cold Wallet          | Token Dist. |   42250000.00 |   42250000.00 |  42250000.00 |
| 124.5  | DT Marks Defi    | WLF USDC Cold Wallet         | Token Dist. |   56036445.00 |   56036445.00 |  56036445.00 |
| 124.5a | DT Marks Defi    | WLF USDC Cold Wallet         | Interest    |        6995.00 |        6995.00 |      6995.00 |
| 124.6  | DT Marks Defi    | WLF ETH Cold Wallet          | Token Dist. |  150606931.00 |  150606931.00 | 150606931.00 |
| 124.6a | DT Marks Defi    | WLF Staked ETH (Coinbase)    | Validator   |     1821628.00 |     1821628.00 |    1821628.00 |
| 124.7  | DT Marks Defi    | WLF BTC Cold Wallet          | Token Dist. |   33462160.00 |   33462160.00 |  33462160.00 |
| 124.8  | DT Marks Defi    | WLF LINK Cold Wallet         | Token Dist. |     2754611.00 |     2754611.00 |    2754611.00 |
| 124.9  | DT Marks Defi    | WLF AAVE Cold Wallet         | Token Dist. |     2608773.00 |     2608773.00 |    2608773.00 |
| 124.10 | DT Marks Defi    | WLF ENA Cold Wallet          | Token Dist. |     1930440.00 |     1930440.00 |    1930440.00 |
| 124.11 | DT Marks Defi    | WLF Move Cold Wallet         | Token Dist. |      810716.00 |      810716.00 |     810716.00 |
| 124.12 | DT Marks Defi    | WLF Ondo Cold Wallet         | Token Dist. |      100245.00 |      100245.00 |     100245.00 |
| 204.1  | Stablecoin Hold  | Stablecoin Business Net Op   | Net Op Inc  |     8326828.00 |     8326828.00 |    8326828.00 |
| 580    | Coinbase Stock   | Coinbase Global Inc. Stock   | Dividend    |        1001.00 |        2500.00 |      1750.50 |
| 1112   | Coinbase Stock   | Coinbase Global Inc. Stock   | Cap Gains   |        5001.00 |       15000.00 |     10000.50 |
| 1113   | Coinbase Stock   | Coinbase Global Inc. Stock   | Cap Gains   |         201.00 |        1000.00 |       600.50 |
|--------+------------------+------------------------------+-------------+----------------+----------------+--------------|
| TOTAL  |                  |                              |             | 1435616397.00  | 1435653893.00  | 1435635145.00|
#+TBLFM: @>$5=vsum(@2$5..@>>$5);%.2f::@>$6=vsum(@2$6..@>>$6);%.2f::@>$7=vsum(@2$7..@>>$7);%.2f

---

* Interesting Findings & Observations

** Staking Validator Income vs. Stablecoin Interest
Staking Ethereum yielded *#$2,332,436.00#* across two entities:
- *#$1,821,628.00#* generated by DT Marks Defi LLC (Line 124.6a).
- *#$510,808.00#* generated by CIC Digital LLC (Line 21.4a).
Both staking agreements are held with *Coinbase*, demonstrating a significant institutional reliance on Coinbase for staking infrastructure. In contrast, standard stablecoin interest (interest earned on USDC keys) brought in only *$45,932.00* (CIC Digital) and *$6,995.00* (WLF), representing a much smaller share.

** Discrepancy Between Wallet Values and Distributed Proceeds
Several cryptocurrency wallets in the report show substantial income distributions from token sales, yet their current reported asset value is negligible (reported as "None" or "less than $1,001"):
- *ENA Key (Line 124.10)*: Received *#$1,930,440.00#* in token proceeds, but current asset value is under $1,001.
- *Move Key (Line 124.11)*: Received *#$810,716.00#* in token proceeds, but current asset value is under $1,001.
- *Ondo Key (Line 124.12)*: Received *#$100,245.00#* in token proceeds, but current asset value is under $1,001.
This suggests these distributed assets were either liquidated, converted to other cryptocurrencies/stablecoins, or transferred to other entities shortly after receipt.

** The Scale of the Digital Asset Footprint
If we exclude the possibly typo-ridden *$635M* Celebration Coins line, Trump's net crypto-related income is still a massive **$800,547,562.00** to **$800,585,058.00**. This reflects a substantial digital asset licensing and project footprint that dwarfs conventional business lines.
